In [1]:
import pandas as pd
import numpy as np

In [2]:
name_list = ["abhi", "surya", "ravi", "himanshu", "gopal", "deepu", "sunil", "mohan", "abhishek", "atul", "lokendra", "yogesh", "nikhil","chetan","sunny"]

In [3]:
city_list = ["jaipur","delhi","goa","mumbai"]

In [10]:
data = {
    'Customer_ID' : range(1,1001),
    'Name' : [np.random.choice(name_list)
                       for _ in range(1000)],
    'Age' : [np.random.randint(18,99)
                     for _ in range(1000)],
    'City' : [np.random.choice(city_list) 
               for _ in range(1000)],
    "Amount": [np.random.randint(100,1000)
               for _ in range(1000)],
    "Rating": [np.random.uniform(1,10)
               for _ in range(1000)]
}

df = pd.DataFrame(data)

df.to_csv("Syntheic_Customer_Data_Generator.csv", index=False)
print("file 'Syntheic_Customer_Data_Generator.csv' ban gayi hai")

file 'Syntheic_Customer_Data_Generator.csv' ban gayi hai

In [11]:
df

     Customer_ID      Name  Age    City  Amount    Rating
0              1     sunil   20     goa     685  5.619080
1              2     gopal   40  jaipur     677  4.334314
2              3     gopal   47  jaipur     457  8.487997
3              4     mohan   20     goa     333  1.284663
4              5     sunny   71  mumbai     737  2.165280
..           ...       ...  ...     ...     ...       ...
995          996    nikhil   24  mumbai     572  8.507718
996          997     sunny   65     goa     191  8.771714
997          998    nikhil   49     goa     929  3.805649
998          999  himanshu   73     goa     319  2.676171
999         1000      ravi   24   delhi     311  6.022808

[1000 rows x 6 columns]